EDT/УТ/src/InformationRegisters/УчетПроектовРазработки/УчетПроектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетПроектовРазработки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПланируемаяДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>CatalogRef.ЭтапыПроектовРазработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостояниеПроектовРазработки/СостояниеПроектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеПроектовРазработки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектовРазработки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>CatalogRef.ЭтапыПроектовРазработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыЭтаповРазработкиПроектов/ВидыЭтаповРазработкиПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭтаповРазработкиПроектов</name>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>Постановка</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>Релиз</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/РолиУчастниковПроектовРазработки/РолиУчастниковПроектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиУчастниковПроектовРазработки</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>Тестировщик</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СостоянияПроектовРазработки/СостоянияПроектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроектовРазработки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Стартован</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ЭтапыПроектовРазработки/ЭтапыПроектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроектовРазработки</name>
  <owners>Catalog.ПроектыРазработки</owners>
  <attributes>
    <name>ВидЭтапа</name>
    <type>
      <types>EnumRef.ВидыЭтаповРазработкиПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ПроектыРазработки/ПроектыРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроектыРазработки</name>
  <attributes>
    <name>НомерРелиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыпущенныйРелиз</name>
    <type>
      <types>CatalogRef.НомераВерсийМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РольУчастника</name>
      <type>
        <types>EnumRef.РолиУчастниковПроектовРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияВерсий</name>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/CommonModules/УправлениеПроектамиРазработкиСервер/Module.bsl
Функция СоздатьЭтапыРазработкиПоУмолчанию(Проект) Экспорт
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Для Сч = 1 По 5 Цикл
		НовЭтап = Справочники.ЭтапыПроектовРазработки.СоздатьЭлемент();
		НовЭтап.Владелец = Проект.Ссылка;
		НовЭтап.НомерЭтапа = Сч;
		
		Если Сч = 1 Тогда
			Этап = Перечисления.ВидыЭтаповРазработкиПроектов.Согласование;
			Наименование = "Согласование";
		ИначеЕсли Сч = 2 Тогда
			Этап = Перечисления.ВидыЭтаповРазработкиПроектов.Постановка;
			Наименование = "Постановка";
		ИначеЕсли Сч = 3 Тогда
			Этап = Перечисления.ВидыЭтаповРазработкиПроектов.Разработка;
			Наименование = "Разработка";
		ИначеЕсли Сч = 4 Тогда
			Этап = Перечисления.ВидыЭтаповРазработкиПроектов.Тестирование;
			Наименование = "Тестирование";
		ИначеЕсли Сч = 5 Тогда
			Этап = Перечисления.ВидыЭтаповРазработкиПроектов.Релиз;
			Наименование = "Релиз";
		КонецЕсли;
		
		НовЭтап.ВидЭтапа = Этап;
		НовЭтап.Наименование = Наименование;
		НовЭтап.Записать();
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
КонецФункции	

Функция ЗафиксироватьПроектВРСПроектовРазработки(Проект) Экспорт
	Ответственный = ПолучитьОсновногоОтветственногоПоПроекту(Проект);
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат Ложь;
	КонецеСли;	
	
	ЗафиксироватьПроектВРСУчетПроектовРазработки(Проект, Ответственный);
	ЗафиксироватьПроектВРССостояниеПроектовРазработки(Проект);
	
	Возврат Истина;
КонецФункции	


Функция ПолучитьОсновногоОтветственногоПоПроекту(Проект) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПроектыРазработкиУчастники.Сотрудник КАК Сотрудник
	            |ИЗ
	            |	Справочник.ПроектыРазработки.Участники КАК ПроектыРазработкиУчастники
	            |ГДЕ
	            |	ПроектыРазработкиУчастники.Ссылка = &Проект
	            |	И ПроектыРазработкиУчастники.РольУчастника = ЗНАЧЕНИЕ(Перечисление.РолиУчастниковПроектовРазработки.ОтветственныйЗаРеализацию)";
	Зап.УстановитьПараметр("Проект", Проект.Ссылка);
	
	Выб = Зап.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Сотрудник;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

Функция ЗафиксироватьПроектВРСУчетПроектовРазработки(Проект, Ответственный) Экспорт
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ЭтапыПроектовРазработки.Ссылка КАК Этап
	            |ИЗ
	            |	Справочник.ЭтапыПроектовРазработки КАК ЭтапыПроектовРазработки
	            |ГДЕ
	            |	ЭтапыПроектовРазработки.Владелец = &Владелец";
	Зап.УстановитьПараметр("Владелец", Проект);
	
	ВыборкаЭтаповРазработки = Зап.Выполнить().Выбрать();
	
	ТекВр = ТекущаяДата();
	
	Наб = РегистрыСведений.УчетПроектовРазработки.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Проект.Установить(Проект);
	
	Нов = Наб.Добавить();
	Нов.Период = ТекВр;
	Нов.Проект = Проект;
	Нов.ПланируемаяДатаНачалаРабот = НачалоДня(ТекущаяДата() + 86400);
	Нов.ПланируемаяДатаОкончанияРабот = НачалоДня(ТекущаяДата() + 86500);
	Нов.Ответственный = Ответственный;
	Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Наб.Записать();
	
	Пока ВыборкаЭтаповРазработки.Следующий() Цикл
		Наб = РегистрыСведений.УчетПроектовРазработки.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(ТекВр);
		Наб.Отбор.Проект.Установить(ВыборкаЭтаповРазработки.Этап);
		
		Нов = Наб.Добавить();
		Нов.Период = ТекВр;
		Нов.Проект = ВыборкаЭтаповРазработки.Этап;
		Нов.ПланируемаяДатаНачалаРабот = НачалоДня(ТекущаяДата() + 86400);
		Нов.ПланируемаяДатаОкончанияРабот = НачалоДня(ТекущаяДата() + 86500);
		Нов.Ответственный = Ответственный;
		Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
		Наб.Записать();
		
	КонецЦикла;	
КонецФункции	


Функция ЗафиксироватьПроектВРССостояниеПроектовРазработки(Проект) Экспорт
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ЭтапыПроектовРазработки.Ссылка КАК Этап
	            |ИЗ
	            |	Справочник.ЭтапыПроектовРазработки КАК ЭтапыПроектовРазработки
	            |ГДЕ
	            |	ЭтапыПроектовРазработки.Владелец = &Владелец";
	Зап.УстановитьПараметр("Владелец", Проект);
	
	ВыборкаЭтаповРазработки = Зап.Выполнить().Выбрать();
	
	ТекВр = ТекущаяДата();
	
	Наб = РегистрыСведений.СостояниеПроектовРазработки.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Проект.Установить(Проект);
	
	Нов = Наб.Добавить();
	Нов.Период = ТекВр;
	Нов.Проект = Проект;
	Нов.Состояние = Перечисления.СостоянияПроектовРазработки.Стартован;
	Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Наб.Записать();
	
	Пока ВыборкаЭтаповРазработки.Следующий() Цикл
		Наб = РегистрыСведений.СостояниеПроектовРазработки.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(ТекВр);
		Наб.Отбор.Проект.Установить(ВыборкаЭтаповРазработки.Этап);
		
		Нов = Наб.Добавить();
		Нов.Период = ТекВр;
		Нов.Проект = ВыборкаЭтаповРазработки.Этап;
		Нов.Состояние = Перечисления.СостоянияПроектовРазработки.Стартован;
		Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
		Наб.Записать();
		
	КонецЦикла;	
КонецФункции	

Функция ПоПроектуСозданыЭтапыПроекта(Проект) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЭтапыПроектовРазработки.Ссылка КАК Ссылка
	            |ИЗ
	            |	Справочник.ЭтапыПроектовРазработки КАК ЭтапыПроектовРазработки
	            |ГДЕ
	            |	ЭтапыПроектовРазработки.Владелец = &Проект";
	Зап.УстановитьПараметр("Проект", Проект);
	Рез = Зап.Выполнить();
	
	Возврат Не Рез.Пустой();
КонецФункции

Функция ПроектУчтенВРСУчетПроектовРазработки(Проект) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	УчетПроектовРазработки.Ответственный КАК Ответственный
	            |ИЗ
	            |	РегистрСведений.УчетПроектовРазработки КАК УчетПроектовРазработки
	            |ГДЕ
	            |	УчетПроектовРазработки.Проект = &Проект";
	Зап.УстановитьПараметр("Проект", Проект);
	Рез = Зап.Выполнить();
	
	Возврат Не Рез.Пустой();
КонецФункции

Функция ПроектУчтенВРССостояниеПроектовРазработки(Проект) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СостояниеПроектовРазработки.Состояние КАК Состояние
	            |ИЗ
	            |	РегистрСведений.СостояниеПроектовРазработки КАК СостояниеПроектовРазработки
	            |ГДЕ
	            |	СостояниеПроектовРазработки.Проект = &Проект";
	Зап.УстановитьПараметр("Проект", Проект);
	Рез = Зап.Выполнить();
	
	Возврат Не Рез.Пустой();
КонецФункции

Функция ПолучитьСписокПодсистемКонфигурации(СписокПодсистем) Экспорт
	Для Каждого Тек Из Метаданные.Подсистемы Цикл
		СписокПодсистем.Добавить(Тек.Имя, Тек.Представление()); 
	КонецЦикла;	
	
	Возврат СписокПодсистем;
КонецФункции	


Процедура ДополнитьСписокПодсистем(СписокПодсистем) Экспорт
	СписокПодсистем.Вставить(0, "МобильноеПриложениеЭкспедиторов", "Мобильное приложение экспедиторов", , Метаданные.ОбщиеКартинки.новаРейс.Картинка);
КонецПроцедуры
